<?php
declare(strict_types=1);

use Migrations\AbstractSeed;

/**
 * Movies seed.
 */
class MoviesSeed extends AbstractSeed
{
    /**
     * Run Method.
     *
     * Write your database seeder using this method.
     *
     * More information on writing seeds is available here:
     * https://book.cakephp.org/phinx/0/en/seeding.html
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'id' => '1',
                'title' => 'Довод',
                'date' => '2020-08-22',
                'director' => 'Кристофер Нолан',
                'budget' => '205000000',
                'poster' => '1920x.jpg',
            ],
            [
                'id' => '2',
                'title' => 'Джанго освобожденный',
                'date' => '2012-12-11',
                'director' => ' Квентин Тарантино',
                'budget' => '100000000',
                'poster' => '300x450.jpg',
            ],
            [
                'id' => '3',
                'title' => 'Интерстеллар',
                'date' => '2014-10-26',
                'director' => 'Кристофер Нолан',
                'budget' => '165000000',
                'poster' => '300x450 (1).jpg',
            ],
            [
                'id' => '4',
                'title' => 'Доктор Стрэндж',
                'date' => '2016-10-13',
                'director' => 'Скотт Дерриксон',
                'budget' => '165000000',
                'poster' => '300x450 (2).jpg',
            ],
            [
                'id' => '5',
                'title' => 'Мстители',
                'date' => '2012-04-11',
                'director' => 'Джосс Уидон',
                'budget' => '220000000',
                'poster' => '300x450 (3).jpg',
            ],
            [
                'id' => '6',
                'title' => 'Мстители: Эра Альтрона',
                'date' => '2015-04-13',
                'director' => 'Джосс Уидон',
                'budget' => '250000000',
                'poster' => '300x450 (altron).jpg',
            ],
            [
                'id' => '8',
                'title' => 'Мстители: Финал',
                'date' => '2019-04-22',
                'director' => 'Энтони Руссо, Джо Руссо',
                'budget' => '356000000',
                'poster' => '300x450 final.jpg',
            ],
            [
                'id' => '9',
                'title' => 'Мстители: Война бесконечности',
                'date' => '2018-04-23',
                'director' => 'Энтони Руссо, Джо Руссо',
                'budget' => '321000000',
                'poster' => '300x450 (4).jpg',
            ],
            [
                'id' => '10',
                'title' => 'Хороший, плохой, злой',
                'date' => '1966-12-23',
                'director' => 'Серджио Леоне',
                'budget' => '1200000',
                'poster' => '300x450 (5).jpg',
            ],
            [
                'id' => '11',
                'title' => 'За пригоршню долларов',
                'date' => '1964-09-12',
                'director' => ' Серджио Леоне',
                'budget' => '',
                'poster' => '300x450 (6).jpg',
            ],
            [
                'id' => '12',
                'title' => 'На несколько долларов больше',
                'date' => '1965-12-18',
                'director' => 'Серджио Леоне',
                'budget' => '600000',
                'poster' => '300x450 (7).jpg',
            ],
            [
                'id' => '13',
                'title' => 'Веном',
                'date' => '2018-10-04',
                'director' => 'Рубен Фляйшер',
                'budget' => '100000000',
                'poster' => '300x450 (8).jpg',
            ],
            [
                'id' => '14',
                'title' => 'Безумный Макс: Дорога ярости',
                'date' => '2015-05-07',
                'director' => ' Джордж Миллер',
                'budget' => '150000000',
                'poster' => '300x450 (9).jpg',
            ],
            [
                'id' => '15',
                'title' => 'Легенда',
                'date' => '2015-09-03',
                'director' => ' Брайан Хелгеленд',
                'budget' => '25000000',
                'poster' => '300x450 (10).jpg',
            ],
            [
                'id' => '16',
                'title' => 'Значит, война',
                'date' => '2012-01-30',
                'director' => ' МакДжи',
                'budget' => '65000000',
                'poster' => '300x450 (11).jpg',
            ],
            [
                'id' => '17',
                'title' => 'Карты, деньги, два ствола',
                'date' => '1998-08-23',
                'director' => ' Гай Ричи',
                'budget' => '',
                'poster' => 'карты деньги.jpg',
            ],
            [
                'id' => '18',
                'title' => 'Большой куш',
                'date' => '2000-09-01',
                'director' => 'Гай Ричи',
                'budget' => '10000000',
                'poster' => '300x450 (12).jpg',
            ],
            [
                'id' => '19',
                'title' => 'Омерзительная восьмерка',
                'date' => '2015-12-07',
                'director' => 'Квентин Тарантино',
                'budget' => '44000000',
                'poster' => '300x450 (13).jpg',
            ],
            [
                'id' => '20',
                'title' => 'Криминальное чтиво',
                'date' => '1994-05-21',
                'director' => ' Квентин Тарантино',
                'budget' => '8000000',
                'poster' => '300x450 (14).jpg',
            ],
            [
                'id' => '21',
                'title' => 'Отступники',
                'date' => '2006-09-26',
                'director' => 'Мартин Скорсезе',
                'budget' => '90000000',
                'poster' => '300x450 (15).jpg',
            ],
            [
                'id' => '22',
                'title' => 'Властелин колец: Возвращение короля',
                'date' => '2003-12-01',
                'director' => ' Питер Джексон',
                'budget' => '94000000',
                'poster' => '300x450 (16).jpg',
            ],
            [
                'id' => '23',
                'title' => 'Властелин колец: Братство Кольца',
                'date' => '2001-12-10',
                'director' => ' Питер Джексон',
                'budget' => '93000000',
                'poster' => '300x450 (17).jpg',
            ],
            [
                'id' => '24',
                'title' => 'Властелин колец: Две крепости',
                'date' => '2002-12-05',
                'director' => ' Питер Джексон',
                'budget' => '94000000',
                'poster' => '300x450 (18).jpg',
            ],
            [
                'id' => '25',
                'title' => 'Начало',
                'date' => '2010-07-08',
                'director' => 'Кристофер Нолан',
                'budget' => '160000000',
                'poster' => '300x450 (19).jpg',
            ],
            [
                'id' => '26',
                'title' => 'Матрица',
                'date' => '1999-03-24',
                'director' => ' Лана Вачовски, Лилли Вачовски',
                'budget' => '63000000',
                'poster' => '300x450 (20).jpg',
            ],
            [
                'id' => '27',
                'title' => 'Матрица: Революция',
                'date' => '2003-11-05',
                'director' => ' Лана Вачовски, Лилли Вачовски',
                'budget' => '150000000',
                'poster' => '300x450 (21).jpg',
            ],
            [
                'id' => '28',
                'title' => 'Матрица: Перезагрузка',
                'date' => '2003-05-07',
                'director' => ' Лана Вачовски, Лилли Вачовски',
                'budget' => '150000000',
                'poster' => '300x450 (22).jpg',
            ],
            [
                'id' => '29',
                'title' => 'Бойцовский клуб',
                'date' => '1999-09-10',
                'director' => ' Дэвид Финчер',
                'budget' => '63000000',
                'poster' => '300x450 (23).jpg',
            ],
            [
                'id' => '30',
                'title' => 'Темный рыцарь',
                'date' => '2008-07-14',
                'director' => ' Кристофер Нолан',
                'budget' => '185000000',
                'poster' => '300x450 (24).jpg',
            ],
            [
                'id' => '31',
                'title' => 'Гарри Поттер и философский камень',
                'date' => '2001-11-04',
                'director' => ' Крис Коламбус',
                'budget' => '125000000',
                'poster' => '300x450 (25).jpg',
            ],
            [
                'id' => '32',
                'title' => 'Звёздные войны: Эпизод 1 — Скрытая угроза',
                'date' => '1999-05-16',
                'director' => 'Джордж Лукас',
                'budget' => '115000000',
                'poster' => '300x450 (26).jpg',
            ],
            [
                'id' => '33',
                'title' => 'Звёздные войны: Эпизод 2 — Атака клонов',
                'date' => '2002-05-12',
                'director' => 'Джордж Лукас',
                'budget' => '115000000',
                'poster' => '300x450 (27).jpg',
            ],
            [
                'id' => '34',
                'title' => 'Звёздные войны: Эпизод 3 — Месть ситхов',
                'date' => '2005-05-12',
                'director' => 'Джордж Лукас',
                'budget' => '113000000',
                'poster' => '300x450 (28).jpg',
            ],
            [
                'id' => '35',
                'title' => 'Звёздные войны: Эпизод 4 — Новая надежда',
                'date' => '1977-05-25',
                'director' => 'Джордж Лукас',
                'budget' => '11000000',
                'poster' => '300x450 (29).jpg',
            ],
            [
                'id' => '36',
                'title' => 'Звёздные войны: Эпизод 5 — Империя наносит ответный удар',
                'date' => '1980-05-17',
                'director' => ' Ирвин Кершнер',
                'budget' => '18000000',
                'poster' => '300x450 (30).jpg',
            ],
            [
                'id' => '37',
                'title' => 'Звёздные войны: Эпизод 6 — Возвращение Джедая',
                'date' => '1983-05-25',
                'director' => 'Ричард Маркуэнд',
                'budget' => '32500000',
                'poster' => '300x450 (31).jpg',
            ],
            [
                'id' => '38',
                'title' => 'Костяной томагавк',
                'date' => '2015-10-01',
                'director' => 'С. Крэйг Залер',
                'budget' => '1800000',
                'poster' => '300x450 (32).jpg',
            ],
        ];

        $table = $this->table('movies');
        $table->insert($data)->save();
    }
}
